# System dependencies
brew "gawk"
brew "gpg"
brew "htop"
brew "jq"
brew "tree"
brew "wget"
brew "zsh"
cask "font-hack-nerd-font"

# Basic
cask "1password"
cask "stats"

# Dev tools
cask "iterm2" 
cask "docker"
cask "visual-studio-code"
cask "android-studio"
cask "fork"
cask "postman"
brew "awscli"
cask "google-cloud-sdk"
brew "asdf" # need to run post-install/asdf.sh
cask "miniconda" # need to run post-install/miniconda.sh
brew "ollama"

# Productivity improvements
cask "flycut" 
cask "rectangle"
cask "lunar"
cask "onedrive"
cask "obsidian"
cask "alfred"
cask "poe"
cask "anydesk"
cask "protonvpn"
cask "logi-options-plus"
cask "openinterminal"

# Multimedia
cask "vlc"
cask "spotify"

# Social apps
cask "signal"
cask "telegram"
cask "whatsapp"
cask "discord"

# Browsers
cask "arc"
cask "google-chrome"
